; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v4 - type_3 ?v7 - type_1)
 	      (pred_4 ?v6 - object ?v7 - type_1)
	      (pred_1 ?v4 - type_3 ?v5 - type_2)
	      (pred_2 ?v4 - type_3 ?v6 - object ?v5 - type_2))

   (:action op_1
       :parameters  (?v4 - type_3 ?v3 ?v2 - type_1)
       :precondition (and  (pred_3 ?v4 ?v3))
       :effect (and  (pred_3 ?v4 ?v2)
		     (not (pred_3 ?v4 ?v3))))

   (:action op_2
       :parameters (?v4 - type_3 ?v8 - object ?v1 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v8 ?v1) (pred_3 ?v4 ?v1) (pred_1 ?v4 ?v5))
       :effect (and (pred_2 ?v4 ?v8 ?v5)
		    (not (pred_4 ?v8 ?v1)) 
		    (not (pred_1 ?v4 ?v5))))

   (:action op_3
       :parameters (?v4 - type_3 ?v8 - object ?v1 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_2 ?v4 ?v8 ?v5) (pred_3 ?v4 ?v1))
       :effect (and (pred_4 ?v8 ?v1)
		    (pred_1 ?v4 ?v5)
		    (not (pred_2 ?v4 ?v8 ?v5)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_09 obj_07 - type_3
obj_10 obj_03 obj_01 obj_02 - type_2
obj_11 obj_04 obj_08 - type_1
obj_06 obj_05 - object)
(:init
(pred_3 obj_09 obj_04)
(pred_1 obj_09 obj_10)
(pred_1 obj_09 obj_03)
(pred_3 obj_07 obj_04)
(pred_1 obj_07 obj_01)
(pred_1 obj_07 obj_02)
(pred_4 obj_06 obj_11)
(pred_4 obj_05 obj_08)
)
(:goal
(and
(pred_4 obj_06 obj_04)
(pred_4 obj_05 obj_04)
)
)

(:constraints
  (always (not (pred_3 obj_09 obj_08)))
)
)

; plan
1. (op_1 obj_09 obj_04 obj_11)
   deleted: (pred_3 obj_09 obj_04)
   added: (pred_3 obj_09 obj_11)
   goals met: 0 of 2
2. (op_1 obj_07 obj_04 obj_08)
   deleted: (pred_3 obj_07 obj_04)
   added: (pred_3 obj_07 obj_08)
   goals met: 0 of 2
3. (op_2 obj_07 obj_05 obj_08 obj_02)
   deleted: (pred_4 obj_05 obj_08) (pred_1 obj_07 obj_02)
   added: (pred_2 obj_07 obj_05 obj_02)
   goals met: 0 of 2
4. (op_2 obj_09 obj_06 obj_11 obj_03)
   deleted: (pred_4 obj_06 obj_11) (pred_1 obj_09 obj_03)
   added: (pred_2 obj_09 obj_06 obj_03)
   goals met: 0 of 2
5. (op_1 obj_07 obj_08 obj_04)
   deleted: (pred_3 obj_07 obj_08)
   added: (pred_3 obj_07 obj_04)
   goals met: 0 of 2
6. (op_1 obj_09 obj_11 obj_04)
   deleted: (pred_3 obj_09 obj_11)
   added: (pred_3 obj_09 obj_04)
   goals met: 0 of 2
7. (op_3 obj_07 obj_05 obj_04 obj_02)
   deleted: (pred_2 obj_07 obj_05 obj_02)
   added: (pred_4 obj_05 obj_04) (pred_1 obj_07 obj_02)
   goals met: 1 of 2
8. (op_3 obj_09 obj_06 obj_04 obj_03)
   deleted: (pred_2 obj_09 obj_06 obj_03)
   added: (pred_4 obj_06 obj_04) (pred_1 obj_09 obj_03)
   goals met: 2 of 2
